# New Movie Studio Analysis for Microsoft

## Overview

This project analyze the type of films the new studio of Microsoft should create. Insights from the project.....

## Business Promlem

- We have to analyze the what types of movies are doing the best in the box office right now. 
- Amazon acquiring MGM. Why? - Amazon said it bought the company because of its library, and plans to remake its titles at TV shows and movies. - IP like Jame Bonds series
- General factors which drives the movies box office success - 
    - star power (popularity of the cast), 
    - acting expertise, 
    - rousing reviews, 
    - public ratings(Imdb, rotten tomatoes), 
    - the genre, 
    - time of release - any seasonality ,
    - marketing of the movie
    - franchise - Marvel/DC/Jame Bond series etc
    
- What could be the top three deciding factors to choose the type of movies to make for Microsoft?
    1. xyz

### Exploring Data
- Box Office Mojo 
- IMDB - SQL database 
- Rotten Tomatoes
- TheMovieDB
- The Numbers

In [86]:
import pandas as pd
import sqlite3

In [87]:
box_office_mojo_df=pd.read_csv('zippedData/bom.movie_gross.csv.gz')
box_office_mojo_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [88]:
rt_movie_info_df=pd.read_csv('zippedData/rt.movie_info.tsv.gz', sep='\t')
rt_movie_info_df.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [89]:
rt_reviews_df=pd.read_csv('zippedData/rt.reviews.tsv.gz', sep='\t', encoding = 'unicode_escape')
rt_reviews_df['fresh'].value_counts()

fresh     33035
rotten    21397
Name: fresh, dtype: int64

In [90]:
rt_reviews_df.loc[rt_reviews_df['fresh'] == 'rotten']

,id,review,rating,fresh,critic,top_critic,publisher,date
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
6,3,"Quickly grows repetitive and tiresome, meander...",C,rotten,Eric D. Snider,0,EricDSnider.com,"July 17, 2013"
7,3,Cronenberg is not a director to be daunted by ...,2/5,rotten,Matt Kelemen,0,Las Vegas CityLife,"April 21, 2013"
12,3,Robert Pattinson works mighty hard to make Cos...,2/4,rotten,Christian Toto,0,Big Hollywood,"January 15, 2013"
18,3,It's fascinating to watch Pattinson actually a...,2/4,rotten,Sean P. Means,0,Salt Lake Tribune,"September 14, 2012"
...,...,...,...,...,...,...,...,...
54424,2000,Dawdles and drags when it should pop; it doesn...,1.5/5,rotten,Manohla Dargis,1,Los Angeles Times,"September 26, 2002"
54426,2000,The film lapses too often into sugary sentimen...,NaN,rotten,Paul Malcolm,1,L.A. Weekly,"September 26, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"

In [91]:
MoviesDB_df=pd.read_csv('zippedData/tmdb.movies.csv.gz')
MoviesDB_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [92]:
Thenum_df=pd.read_csv('zippedData/tn.movie_budgets.csv.gz')
Thenum_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [93]:
Thenum_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [94]:
con = sqlite3.connect('./zippedData/im.db')

In [95]:
def read_sql_as_df(table_name, con):
    """
    Selects all columns in a database table and convert it into a Dataframe
    -
    Input:
    table_name = takes in a string of the table name to import
    con = variable that has the established database connection   
    -
    Output:
    DataFrame containing all columns of the database table.
    """
    query = """SELECT * FROM ({table_name})""".format(table_name = table_name)
    return pd.read_sql(query,con)

In [96]:
#read_sql_as_df(, con)

# Return on investment on the movies

We want to calculate the return of investment and total gross revenues of the movies and sort the data with the highest grossing movies first.

--- Box Office Mojo data

In [97]:
# Using the Box Office Mojo data, we calculate the Total Gross revenue and put it in a new df called "BOM_financials_df"
BOM_financials_df=box_office_mojo_df

In [98]:
BOM_financials_df.isna().sum() # we see some null values, lets check if any entires with null in both domestic and foreign

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [99]:
BOM_financials_df.loc[(BOM_financials_df['domestic_gross'].isna() == True) &(BOM_financials_df['foreign_gross'].isna() == True)]

Empty DataFrame
Columns: [title, studio, domestic_gross, foreign_gross, year]
Index: []

In [100]:
#change the foreign gross to float datatype
BOM_financials_df['foreign_gross'] = BOM_financials_df['foreign_gross'].str.replace(',','')
BOM_financials_df['foreign_gross'] = BOM_financials_df['foreign_gross'].astype(float)

In [101]:
# no rows in the data with no gross values, good thing. 
# create a new total gross column 
BOM_financials_df["total_gross (000.000)"] = (BOM_financials_df['domestic_gross'] + BOM_financials_df['foreign_gross'])/1000000
BOM_financials_df.sort_values(by='total_gross (000.000)', ascending=False)

,title,studio,domestic_gross,foreign_gross,year,total_gross (000.000)
727,Marvel's The Avengers,BV,623400000.0,895500000.0,2012,1518.9
1875,Avengers: Age of Ultron,BV,459000000.0,946400000.0,2015,1405.4
3080,Black Panther,BV,700100000.0,646900000.0,2018,1347.0
328,Harry Potter and the Deathly Hallows Part 2,WB,381000000.0,960500000.0,2011,1341.5
2758,Star Wars: The Last Jedi,BV,620200000.0,712400000.0,2017,1332.6
...,...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018,NaN
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018,NaN
3384,El Pacto,Sony,2500.0,NaN,2018,NaN
3385,The Swan,Synergetic,2400.0,NaN,2018,NaN
3386,An Actor Prepares,Grav.,1700.0,NaN,2018,NaN

---- The Numbers Data

In [102]:
TB_financials_df=Thenum_df
TB_financials_df.isna().sum() #yay no null values!

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [103]:
TB_financials_df

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [105]:
# check if date type is consistent
TB_financials_df.info() #no, check into float

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [106]:
#first remove $ and commas
TB_financials_df['production_budget'] = TB_financials_df['production_budget'].str.replace('$','')
TB_financials_df['production_budget'] = TB_financials_df['production_budget'].str.replace(',','')
TB_financials_df['domestic_gross'] = TB_financials_df['domestic_gross'].str.replace('$','')
TB_financials_df['domestic_gross'] = TB_financials_df['domestic_gross'].str.replace(',','')
TB_financials_df['worldwide_gross'] = TB_financials_df['worldwide_gross'].str.replace('$','')
TB_financials_df['worldwide_gross'] = TB_financials_df['worldwide_gross'].str.replace(',','')

#convert production_budget, domestic_gross, worldwide_gross to float
TB_financials_df['production_budget'] = TB_financials_df['production_budget'].astype(float)
TB_financials_df['domestic_gross'] = TB_financials_df['domestic_gross'].astype(float)
TB_financials_df['worldwide_gross'] = TB_financials_df['worldwide_gross'].astype(float)

In [107]:
TB_financials_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   float64
 4   domestic_gross     5782 non-null   float64
 5   worldwide_gross    5782 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 271.2+ KB

In [113]:
#Calculate the ROI
TB_financials_df['ROI'] = TB_financials_df['worldwide_gross'] / TB_financials_df['production_budget']

#sort the rows by ROI
TB_financials_df = TB_financials_df.sort_values(by ='ROI', ascending=False)

In [115]:
TB_financials_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,ROI
5745,46,"Jun 30, 1972",Deep Throat,25000.0,45000000.0,45000000.0,1800.000000
5613,14,"Mar 21, 1980",Mad Max,200000.0,8750000.0,99750000.0,498.750000
5492,93,"Sep 25, 2009",Paranormal Activity,450000.0,107918810.0,194183034.0,431.517853
5679,80,"Jul 10, 2015",The Gallows,100000.0,22764410.0,41656474.0,416.564740
5406,7,"Jul 14, 1999",The Blair Witch Project,600000.0,140539099.0,248300000.0,413.833333